-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: localhost    Database: university database
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `FullName` varchar(255) NOT NULL,
  `Birth` date NOT NULL,
  `Children` tinyint NOT NULL,
  `Team_id` int unsigned NOT NULL,
  `Grantt` decimal(8,2) NOT NULL,
  `Gender` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `Team_id_idx` (`Team_id`),
  CONSTRAINT `Team_id_1` FOREIGN KEY (`Team_id`) REFERENCES `team` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=183 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES (3,'Сидорова Е.Н.','2002-12-31',0,5,180.00,'F'),(4,'Кузнецов А.Г.','2002-02-28',1,1,95.20,'M'),(5,'Соколова Т.В.','2002-11-27',1,5,200.00,'F'),(6,'Михайлов Д.С.','2002-12-31',1,5,175.00,'M'),(7,'Федорова О.А.','2002-12-31',0,5,140.00,'F'),(8,'Александров К.К.','2002-04-22',0,1,110.40,'M'),(9,'Козлова А.М.','2002-12-31',1,5,16090.00,'F'),(10,'Никитин В.В.','2002-12-31',0,5,14120.00,'M'),(11,'Куликов Д.П.','2002-12-31',1,5,190.00,'M'),(12,'Степанова Л.И.','2000-10-14',0,2,0.00,'F'),(13,'Павлов С.С.','2001-12-25',1,2,98.70,'M'),(14,'Григорьева А.Д.','2000-08-11',0,2,200.00,'F'),(15,'Васнецов Г.А.','2002-03-19',0,2,115.40,'M'),(16,'Андреев Д.О.','2001-02-17',1,2,140.25,'M'),(17,'Тимофеева Е.Ю.','2000-07-05',0,2,0.00,'F'),(18,'Кузьмин В.В.','2002-01-23',1,2,105.80,'M'),(19,'Щербакова М.С.','2001-10-09',0,2,195.40,'F'),(20,'Комаров А.Н.','2000-05-28',1,2,0.00,'M'),(21,'Белкин П.В.','2001-09-15',0,3,150.70,'M'),(22,'Крылова Л.К.','2000-04-03',0,3,170.20,'F'),(23,'Ильин А.А.','2002-03-11',1,3,95.60,'M'),(24,'Афанасьева Г.Н.','2001-07-22',0,3,0.00,'F'),(25,'Захаров С.В.','2000-11-09',1,3,125.30,'M'),(26,'Фомина Е.И.','2001-06-18',0,3,160.40,'F'),(27,'Медведев Н.Н.','2000-12-03',1,3,135.80,'M'),(28,'Лебедева Т.А.','2002-02-01',0,3,0.00,'F'),(29,'Кузьмин Д.И.','2000-08-09',0,3,112.50,'M'),(30,'Анисимова А.С.','2001-05-26',1,3,185.20,'F'),(31,'Стрельцов А.П.','2000-09-30',0,4,170.00,'M'),(32,'Полякова Н.И.','2002-04-07',0,4,0.00,'F'),(33,'Артемьев И.В.','2000-01-14',0,4,145.80,'M'),(34,'Савельева О.С.','2001-03-23',1,4,180.40,'F'),(35,'Волков А.П.','2000-10-01',0,4,120.60,'M'),(36,'Мельникова К.Д.','2002-07-08',1,4,95.90,'F'),(37,'Шестаков С.А.','2001-09-17',0,4,0.00,'M'),(38,'Колесникова А.А.','2000-05-29',1,4,130.70,'F'),(39,'Лазарев П.Г.','2001-12-10',0,4,155.20,'M'),(40,'Семенова Г.М.','2000-06-12',0,4,175.50,'F'),(41,'Журавлев В.С.','2002-02-18',1,5,0.00,'M'),(42,'Герасимова Е.Ф.','2001-08-25',0,5,140.30,'F'),(43,'Воробьев А.А.','2000-03-05',0,5,200.00,'M'),(44,'Трофимова К.П.','2001-01-20',0,5,125.60,'F'),(45,'Логинов С.Н.','2000-07-31',1,5,165.70,'M'),(46,'Петухова А.Е.','2001-04-27',0,5,0.00,'F'),(47,'Беляков Д.В.','2000-11-14',0,5,112.30,'M'),(48,'Крылов С.А.','2002-06-21',0,5,98.50,'M'),(49,'Щеглова Е.П.','2001-10-06',0,5,145.40,'F'),(50,'Макаров А.Ю.','2000-04-19',1,5,175.90,'M'),(51,'Данилова В.И.','2002-03-07',0,6,130.20,'F'),(52,'Козлов В.П.','2001-06-15',0,6,160.60,'M'),(53,'Антонова А.А.','2000-09-26',1,6,150.80,'F'),(54,'Сухарев И.Г.','2002-01-02',0,6,112.90,'M'),(55,' Жукова О.В.','2001-07-09',0,6,0.00,'F'),(56,'Борисов В.Е.','2000-12-16',0,6,95.40,'M'),(57,'Григорьев В.М.','2001-05-03',0,6,0.00,'M'),(58,'Михайлова Т.С.','2000-08-20',1,6,135.60,'F'),(59,'Сорокина А.Н.','2002-04-26',0,6,170.40,'M'),(60,'Родионова Е.И.','2000-09-09',0,6,145.20,'F'),(61,'Ефимов И.О.','2001-02-25',0,7,105.70,'M'),(62,'Шарова Н.П.','2000-07-12',0,7,0.00,'F'),(63,'Герасимов П.А.','2002-01-28',1,7,160.90,'M'),(64,'Кузнецова Е.С.','2001-11-15',0,7,120.30,'F'),(65,'Лихачев И.Д.','2000-06-02',0,7,0.00,'M'),(66,'Морозова Л.В.','2002-03-16',0,7,98.20,'F'),(67,'Наумов А.К.','2001-08-03',0,7,200.00,'M'),(68,'Филиппова Т.Г.','2000-10-20',1,7,130.50,'F'),(69,'Степанов П.С.','2002-05-27',0,7,145.70,'M'),(70,'Лебедь В.Н.','2001-01-14',0,7,0.00,'M'),(71,'Павлова Е.В.','2000-07-30',1,8,112.40,'F'),(72,'Горбунов И.А.','2001-12-09',0,8,160.20,'M'),(73,'Козырева С.И.','2000-05-12',0,8,175.40,'F'),(74,'Анисимов Н.П.','2002-02-18',0,8,95.80,'M'),(75,'Медведева А.А.','2001-09-26',0,8,0.00,'F'),(76,'Чернов В.Г.','2000-04-10',1,8,125.60,'M'),(77,'Иванова С.В.','2001-11-27',0,8,170.70,'F'),(78,'Куликов Г.Д.','2000-08-04',0,8,150.40,'M'),(79,'Белова Т.А.','2002-04-17',1,8,185.30,'F'),(80,'Симонов Д.О.','2000-09-29',0,8,140.90,'M'),(81,'Козлова О.П.','2001-06-16',0,9,155.50,'F'),(82,'Андреев Г.В.','2000-11-03',1,9,180.20,'M'),(83,'Сорокин Д.А.','2002-03-30',0,9,112.80,'M'),(84,'Ильина Е.С.','2001-08-09',0,9,145.30,'F'),(85,'Громов А.И.','2000-01-26',0,9,200.00,'M'),(86,'Киселева В.В.','2001-07-03',0,9,130.40,'F'),(87,'Максимов П.П.','2000-10-18',0,9,175.60,'M'),(88,'Сидоров В.Д.','2002-05-25',1,9,98.60,'M'),(89,'Ковалева А.С.','2001-02-11',0,9,160.70,'F'),(90,'Егоров Д.Н.','2000-09-28',0,9,145.90,'M'),(91,'Миронова Л.В.','2002-02-05',0,10,95.30,'F'),(92,'Воронин П.Г.','2001-09-12',0,10,200.00,'M'),(93,'Фролова С.А.','2000-04-15',1,10,120.80,'F'),(94,'Кудрявцев Г.С.','2001-12-22',0,10,155.20,'M'),(95,'Нестерова Т.Д.','2000-07-04',0,10,170.80,'F'),(96,'Блинова Е.В.','2002-01-09',1,10,112.70,'M'),(97,'Троицкий А.А.','2001-04-17',0,10,145.40,'M'),(98,'Галкина О.И.','2000-11-24',0,10,95.40,'F'),(99,'Поляков Г.А.','2002-06-01',0,10,200.00,'M'),(100,'Кошкина А.П.','2000-09-10',1,10,130.60,'F'),(101,'Макарова А.К.','2001-02-18',0,11,160.20,'F'),(102,'Смирнов Д.В.','2000-07-03',0,11,175.30,'M'),(103,'Белов Г.П.','2002-04-07',0,11,98.70,'M'),(104,'Антонова Е.Д.','2001-09-18',0,11,200.00,'F'),(105,'Петров Д.С.','2000-04-23',1,11,135.20,'M'),(106,'Гришина Т.М.','2002-01-30',0,11,150.70,'F'),(107,'Лебедев А.Г.','2001-06-27',0,11,170.40,'M'),(108,'Краснов С.А.','2000-11-10',0,11,95.80,'M'),(109,'Миронова Е.П.','2002-03-17',0,11,200.00,'F'),(110,'Артемьева И.Н.','2001-08-24',1,11,145.60,'F'),(111,'Исаков П.В.','2000-03-09',0,12,160.90,'M'),(112,'Николаев И.А.','2001-10-26',0,12,112.30,'M'),(113,'Васнецова О.Л.','2000-05-13',1,12,0.00,'F'),(114,'Федоров И.Г.','2002-02-20',0,12,135.90,'M'),(115,'Козлова Л.М.','2001-07-03',0,12,150.40,'F'),(116,'Гусев А.Н.','2000-12-20',0,12,98.50,'M'),(117,'Левина О.П.','2001-05-28',0,12,0.00,'F'),(118,'Белов В.С.','2000-10-06',1,12,145.80,'M'),(119,'Жуков И.И.','2002-04-13',0,12,160.20,'F'),(120,'Смирнова М.В.','2001-09-20',0,12,175.50,'M'),(121,'Васнецов В.Г.','2000-04-03',0,13,95.70,'M'),(122,'Сергеева А.А.','2002-01-10',0,13,200.00,'F'),(123,'Тимофеев В.М.','2001-06-17',1,13,130.80,'M'),(124,'Маркова Е.Е.','2000-11-24',0,13,150.60,'F'),(125,'Козлов Д.Г.','2002-06-01',0,13,98.90,'M'),(126,'Иванова Н.В.','2001-11-08',0,13,200.00,'F'),(127,'Петров И.И.','2000-08-16',0,13,112.40,'M'),(128,'Фомина Е.А.','2002-03-23',1,13,170.90,'F'),(129,'Михайлов В.В.','2001-08-29',0,13,160.40,'M'),(130,'Краснова А.А.','2000-02-04',0,13,95.60,'F'),(131,'Сидоров В.В.','2002-01-11',0,14,0.00,'M'),(132,'Козлов Г.И.','2001-04-18',1,14,145.70,'F'),(133,'Миронов И.П.','2000-09-25',0,14,175.20,'M'),(134,'Артемьев С.А.','2002-05-03',0,14,112.90,'M'),(135,'Васнецова Г.С.','2001-10-10',0,14,98.20,'F'),(136,'Беликов А.М.','2000-07-17',0,14,0.00,'M'),(137,'Лебедева Д.О.','2001-12-24',1,14,135.60,'F'),(138,'Николаев Д.В.','2000-06-30',0,14,160.90,'M'),(139,'Сорокина А.В.','2002-02-09',0,14,175.40,'F'),(140,'Логинов С.А.','2001-07-26',0,14,95.80,'M'),(141,'Герасимов Г.Г.','2000-12-02',0,15,0.00,'M'),(142,'Козлова С.П.','2001-05-09',1,15,145.80,'F'),(143,'Артемьев Н.А.','2000-10-16',0,15,160.20,'M'),(144,'Максимова Т.И.','2002-03-21',0,15,112.30,'F'),(145,'Киселев В.М.','2001-08-28',0,15,98.40,'M'),(146,'Никитина Г.Д.','2000-01-03',0,15,0.00,'F'),(147,'Смирнов С.С.','2002-06-10',0,15,135.90,'M'),(148,'Исаева А.В.','2001-11-17',1,15,170.40,'F'),(149,'Григорьев А.Н.','2000-04-24',0,15,150.70,'M'),(150,'Анисимова С.П.','2002-01-31',0,15,200.00,'F');
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-31 19:34:27
