-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: localhost    Database: university database
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teacher`
--

DROP TABLE IF EXISTS `teacher`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teacher` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `Department_id` int unsigned NOT NULL,
  `FullName` varchar(255) NOT NULL,
  `Category` varchar(255) NOT NULL,
  `Birth` date NOT NULL,
  `Child` tinyint NOT NULL,
  `Salary` decimal(8,2) NOT NULL,
  `Gender` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `Department_id_idx` (`Department_id`),
  CONSTRAINT `Department_id` FOREIGN KEY (`Department_id`) REFERENCES `department` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teacher`
--

LOCK TABLES `teacher` WRITE;
/*!40000 ALTER TABLE `teacher` DISABLE KEYS */;
INSERT INTO `teacher` VALUES (1,1,' Иванов А.И.','Ассистент','1985-03-15',0,900.00,'M'),(2,2,'Петрова Е.П.','Преподаватель','1978-08-22',1,1200.00,'F'),(3,3,'Сидоров В.С.','Старший преподаватель','1970-05-10',1,1500.00,'M'),(4,4,'Козлова Н.А.','Доцент','1982-11-30',1,1000.00,'F'),(5,5,'Федоров Г.И.','Профессор','1965-04-18',1,1600.00,'M'),(6,7,'Семенов И.Р.','Преподаватель','1980-09-05',1,1500.00,'M'),(7,6,'Ковалева М.В.','Старший преподаватель','1975-06-20',0,1500.00,'F'),(8,8,'Исаков А.Г.','Доцент','1988-12-12',1,1100.00,'M'),(9,9,'Григорьева Л.А.',' Преподаватель','1983-04-02',1,1200.00,'F'),(10,10,'Николаев П.С.','Профессор','1968-10-08',0,1500.00,'M'),(11,11,'Макарова Е.И.','Старший преподаватель','1972-07-15',0,1500.00,'F'),(12,12,'Степанов В.М.','Ассистент','1987-02-25',1,900.00,'M'),(13,13,'Павлова С.А.','Доцент','1981-11-01',1,1000.00,'F'),(14,14,'Тимофеев Г.В.','Профессор','1966-06-12',1,1200.00,'M'),(15,15,'Лебедева О.П.','Старший преподаватель','1974-03-30',1,1500.00,'F'),(16,16,'Кузнецов А.Н.','Ассистент','1984-08-18',1,1000.00,'M'),(17,16,'Андреева И.Д.','Доцент','1989-01-20',0,1100.00,'F'),(18,15,'Белов В.И.','Преподаватель','1979-09-10',0,1200.00,'M'),(19,14,'Жукова Е.С.','Старший преподаватель','1971-04-05',1,1500.00,'F'),(20,13,'Орлова Н.М.','Ассистент','1986-12-08',1,1000.00,'F'),(21,12,'Стрелков Р.В.','Профессор','1967-07-22',0,1700.00,'M'),(22,11,'Соловьева А.П.','Преподаватель','1980-03-15',1,1200.00,'F'),(23,10,'Игнатьев М.Г.','Старший преподаватель','1973-09-02',1,1500.00,'M'),(24,9,'Федотова Л.А.','Ассистент','1982-06-20',1,900.00,'F'),(25,8,'Комаров Г.С.','Доцент','1987-11-30',0,1000.00,'M'),(26,7,'Носова А.И.','Профессор','1964-04-18',1,1200.00,'F'),(27,6,'Мартынов В.П.','Старший преподаватель','1976-02-10',1,1500.00,'M'),(28,5,'Полякова Е.А.','Ассистент','1983-10-05',1,1000.00,'F'),(29,4,'Тихонов Н.Г.','Доцент','1980-05-02',0,1000.00,'M'),(30,3,'Фомина С.М.','Преподаватель','1977-12-12',1,1200.00,'F'),(31,2,'Попова Д.С.','Старший преподаватель','1979-08-15',1,1600.00,'M'),(32,1,'Сергеева А.Г.','Ассистент','1988-04-25',1,800.00,'F'),(33,1,'Казаков П.А.','Профессор','1969-03-18',0,1200.00,'M'),(34,2,'Белкина Н.В.','Преподаватель','1984-07-22',1,1200.00,'F'),(35,3,'Куликова С.Д.','Старший преподаватель','1972-11-30',1,1600.00,'F'),(36,4,'Лебедев Е.П.','Ассистент','1985-10-08',1,1000.00,'M'),(37,5,'Стрелкова Г.М.','Доцент','1981-06-12',1,900.00,'F'),(38,6,'Петров А.И.','Профессор','1966-02-10',1,1200.00,'M'),(39,7,'Мартынова В.А.','Старший преподаватель','1974-10-05',0,1500.00,'F'),(40,8,'Поляков И.Н.','Ассистент','1989-01-20',1,1000.00,'M'),(41,9,'Тихонова М.Г.','Доцент ','1985-03-15',1,700.00,'F'),(42,10,'Фомина А.П. ','Преподаватель','1980-05-02',1,1200.00,'F'),(43,11,'Сергеева С.А. ','Старший преподаватель','1977-12-12',0,1500.00,'F'),(44,12,'Казакова Н.Д.','Ассистент','1979-08-15',1,1000.00,'F'),(45,13,'Белкин П.В.','Профессор','1988-04-25',1,1500.00,'M'),(46,14,'Куликов С.И.','Преподаватель','1969-03-18',1,1200.00,'M'),(47,15,'Лебедева Г.С. ','Старший преподаватель','1984-07-22',1,1500.00,'F'),(48,16,'Стрелков А.В. ','Ассистент','1972-11-30',1,800.00,'M'),(49,14,'Стрелкова Е.М. ','Доцент','1985-10-08',0,900.00,'F'),(50,15,'Тихонова И.П. ','Профессор','1981-06-12',1,1200.00,'F');
/*!40000 ALTER TABLE `teacher` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-31 19:34:27
