-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: localhost    Database: university database
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `control`
--

DROP TABLE IF EXISTS `control`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `control` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `Subject_id` int unsigned NOT NULL,
  `Student_id` int unsigned NOT NULL,
  `Teacher_id` int unsigned NOT NULL,
  `Mark` int NOT NULL,
  `Date` date NOT NULL,
  `Control_form` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `Subject_id_idx` (`Subject_id`),
  KEY `Teacher_id_idx` (`Teacher_id`),
  CONSTRAINT `Student_id_5` FOREIGN KEY (`Subject_id`) REFERENCES `student` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `Subject_id_1` FOREIGN KEY (`Subject_id`) REFERENCES `subjectt` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `Teacher_id_3` FOREIGN KEY (`Teacher_id`) REFERENCES `teacher` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `control`
--

LOCK TABLES `control` WRITE;
/*!40000 ALTER TABLE `control` DISABLE KEYS */;
INSERT INTO `control` VALUES (16,3,16,2,9,'2023-06-02','экзамен'),(17,3,17,2,4,'2023-06-02','экзамен'),(18,3,18,2,5,'2023-06-02','экзамен'),(19,3,19,2,4,'2023-06-02','экзамен'),(20,3,20,2,4,'2023-06-02','экзамен'),(21,4,21,3,10,'2023-06-09','экзамен'),(22,4,22,3,9,'2023-06-09','экзамен'),(23,4,23,3,7,'2023-06-09','экзамен'),(24,4,24,3,4,'2023-06-09','экзамен'),(25,4,25,3,5,'2023-06-09','экзамен'),(26,4,26,3,7,'2023-06-09','экзамен'),(27,4,27,3,8,'2023-06-09','экзамен'),(28,4,28,3,4,'2023-06-09','экзамен'),(29,4,29,3,6,'2023-06-09','экзамен'),(30,4,30,3,4,'2023-06-09','экзамен'),(31,5,31,4,10,'2023-01-12','зачет'),(32,5,32,4,4,'2023-01-12','зачет'),(33,5,33,4,9,'2023-01-12','зачет'),(34,5,34,4,8,'2023-01-12','зачет'),(35,5,35,4,7,'2023-01-12','зачет'),(36,5,36,4,6,'2023-01-12','зачет'),(37,5,37,4,5,'2023-01-12','зачет'),(38,5,38,4,4,'2023-01-12','зачет'),(39,5,39,4,4,'2023-01-12','зачет'),(40,5,40,4,3,'2023-01-12','зачет'),(41,6,41,5,4,'2023-06-15','экзамен'),(42,6,42,5,10,'2023-06-15','экзамен'),(43,6,43,5,8,'2023-06-15','экзамен'),(44,6,44,5,7,'2023-06-15','экзамен'),(45,6,45,5,5,'2023-06-15','экзамен'),(46,7,46,5,4,'2023-06-15','зачет'),(47,7,47,5,2,'2023-06-15','зачет'),(48,7,48,5,1,'2023-06-15','зачет'),(49,7,49,5,8,'2023-06-15','зачет'),(50,7,50,5,7,'2023-06-15','зачет'),(51,8,51,6,10,'2023-06-22','зачет'),(52,8,52,6,8,'2023-06-22','зачет'),(53,8,53,6,6,'2023-06-22','зачет'),(54,8,54,6,8,'2023-06-22','зачет'),(55,8,55,6,4,'2023-06-22','зачет'),(56,8,56,6,4,'2023-06-22','зачет'),(57,8,57,6,4,'2023-06-22','зачет'),(58,8,58,6,8,'2023-06-22','зачет'),(59,8,59,6,9,'2023-06-22','зачет'),(60,8,60,6,10,'2023-06-22','зачет'),(61,9,61,7,5,'2023-06-22','экзамен'),(62,9,62,7,4,'2023-06-22','экзамен'),(63,9,63,7,8,'2023-06-22','экзамен'),(64,9,64,7,7,'2023-06-22','экзамен'),(65,9,65,7,4,'2023-06-22','экзамен'),(66,9,66,7,3,'2023-06-22','экзамен'),(67,9,67,7,2,'2023-06-22','экзамен'),(68,9,68,7,2,'2023-06-22','экзамен'),(69,9,69,7,1,'2023-06-22','экзамен'),(70,9,70,7,4,'2023-06-22','экзамен'),(71,10,71,8,7,'2023-06-18','зачет'),(72,10,72,8,5,'2023-06-18','зачет'),(73,10,73,8,3,'2023-06-18','зачет'),(74,10,74,8,10,'2023-06-18','зачет'),(75,10,75,8,4,'2023-06-18','зачет'),(76,11,76,8,8,'2023-06-18','экзамен'),(77,11,77,8,9,'2023-06-18','экзамен'),(78,11,78,8,7,'2023-06-18','экзамен'),(79,11,79,8,7,'2023-06-18','экзамен'),(80,11,80,9,7,'2023-06-18','экзамен'),(81,12,81,9,1,'2023-01-29','экзамен'),(82,12,82,9,10,'2023-01-29','экзамен'),(83,12,83,9,2,'2023-01-29','экзамен'),(84,12,84,9,3,'2023-01-29','экзамен'),(85,12,85,9,5,'2023-01-29','экзамен'),(86,12,86,9,6,'2023-01-29','экзамен'),(87,12,87,9,7,'2023-01-29','экзамен'),(88,12,88,9,8,'2023-01-29','экзамен'),(89,12,89,9,9,'2023-01-29','экзамен'),(90,12,90,9,7,'2023-01-29','экзамен'),(91,13,91,10,10,'2023-01-21','зачет'),(92,13,92,10,2,'2023-01-21','зачет'),(93,13,93,10,3,'2023-01-21','зачет'),(94,13,94,10,5,'2023-01-21','зачет'),(95,13,95,10,7,'2023-01-21','зачет'),(96,13,96,10,8,'2023-01-21','зачет'),(97,13,97,10,9,'2023-01-21','зачет'),(98,13,98,10,10,'2023-01-21','зачет'),(99,13,99,10,1,'2023-01-21','зачет'),(100,13,100,10,6,'2023-01-21','зачет'),(101,14,101,11,10,'2023-01-08','экзамен'),(102,14,102,11,3,'2023-01-08','экзамен'),(103,14,103,11,6,'2023-01-08','экзамен'),(104,14,104,11,3,'2023-01-08','экзамен'),(105,14,105,11,5,'2023-01-08','экзамен'),(106,15,106,11,8,'2023-01-08','зачет'),(107,15,107,11,6,'2023-01-08','зачет'),(108,15,108,11,8,'2023-01-08','зачет'),(109,15,109,11,9,'2023-01-08','зачет'),(110,15,110,11,5,'2023-01-08','зачет'),(111,16,111,12,3,'2023-06-18','зачет'),(112,16,112,12,1,'2023-06-18','зачет'),(113,16,113,12,4,'2023-06-18','зачет'),(114,16,114,12,5,'2023-06-18','зачет'),(115,16,115,12,7,'2023-06-18','зачет'),(116,16,116,12,9,'2023-06-18','зачет'),(117,16,117,12,4,'2023-06-18','зачет'),(118,16,118,12,10,'2023-06-18','зачет'),(119,16,119,12,4,'2023-06-18','зачет'),(120,16,120,12,6,'2023-06-18','зачет'),(121,17,121,13,10,'2023-01-14','экзамен'),(122,17,122,13,9,'2023-01-14','экзамен'),(123,17,123,13,3,'2023-01-14','экзамен'),(124,17,124,13,6,'2023-01-14','экзамен'),(125,18,125,13,4,'2023-01-14','зачет'),(126,18,126,13,6,'2023-01-14','зачет'),(127,18,127,13,8,'2023-01-14','зачет'),(128,18,128,13,9,'2023-01-14','зачет'),(129,18,129,13,10,'2023-01-14','зачет'),(130,19,130,13,10,'2023-01-14','экзамен'),(131,19,131,14,10,'2023-06-17','зачет'),(132,19,132,14,10,'2023-06-17','зачет'),(133,19,133,14,6,'2023-06-17','зачет'),(134,19,134,14,5,'2023-06-17','зачет'),(135,19,135,14,3,'2023-06-17','зачет'),(136,19,136,14,2,'2023-06-17','зачет'),(137,19,137,14,3,'2023-06-17','зачет'),(138,19,138,14,6,'2023-06-17','зачет'),(139,19,139,14,7,'2023-06-17','зачет'),(140,20,140,14,1,'2023-06-17','зачет'),(141,20,141,15,4,'2023-01-31','экзамен'),(142,20,142,15,1,'2023-01-31','экзамен'),(143,20,143,15,5,'2023-01-31','экзамен'),(144,20,144,15,7,'2023-01-31','экзамен'),(145,21,145,15,9,'2023-01-31','зачет'),(146,21,146,15,4,'2023-01-31','зачет'),(147,21,147,15,10,'2023-01-31','зачет'),(148,21,148,15,1,'2023-01-31','зачет'),(149,21,149,15,2,'2023-01-31','зачет'),(150,22,150,15,5,'2023-01-31','экзамен'),(151,22,151,16,7,'2023-01-20','зачет'),(152,22,152,16,8,'2023-01-20','экзамен'),(153,22,153,16,9,'2023-01-20','экзамен'),(154,22,154,16,10,'2023-01-20','экзамен'),(155,23,155,16,1,'2023-01-20','зачет'),(156,23,156,16,2,'2023-01-20','зачет'),(157,23,157,16,5,'2023-01-20','зачет'),(158,23,158,16,8,'2023-01-20','зачет'),(159,23,159,16,9,'2023-01-20','зачет'),(160,23,160,16,7,'2023-01-20','зачет');
/*!40000 ALTER TABLE `control` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-31 19:34:27
